---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
RebarShapeConstraintSagittaLength Properties
RebarShapeConstraintSagittaLength Class See Also Send Feedback
---

The RebarShapeConstraintSagittaLength type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from RebarShapeConstraint.) |

# See Also

RebarShapeConstraintSagittaLength Class

Autodesk.Revit.DB.Structure Namespace